const recommendations = {
  articles: [
    {
      id: 1538,
      title: '目白之檻',
      recommendations: [
        {
          name: '盈盈星尘',
          reason: ['沉重的爱之重马场，也是麦昆对你倾其一生的爱。'],
        },
        {
          name: '黑羽仙洛',
          reason: [
            '符合常识、润物细无声的重马场可比随随便便地下室逆马儿跳要来得更加恐怖，也更加好味。标题也无愧为目白之“檻”啊。',
          ],
        },
      ],
    },
    {
      id: 3457,
      title: '快子(Tachyon)曾梦扑火飞蛾乎',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '非常不错的速子短篇底子，从这对速子和豚鼠身上看到了许多我非常喜爱的要素。',
            '做梦都想读到这么一篇精彩、优美而疯狂的速子文，每一个细节都是我理想中的形状，简直就是在我的xp上跳舞。作者文笔也十分了得。',
          ],
        },
        {
          name: '风之低吟',
          reason: [
            '两个角色、一个概念正好构成了两组对照，与标题遥相呼应。',
            '结局虽不完美，但从对照的关系去思考，又不得不承认角色某种意义上还是达成了自己的目的。',
            '结构巧妙，情节感人，推荐一读。',
          ],
        },
      ],
    },
    {
      id: 949,
      title: '米浴 隐婚',
      recommendations: [
        {
          name: '盈盈星尘',
          reason: [
            '轻松幽默，让人全程看下来忍俊不禁，再到最后揭露的哑然失笑。',
          ],
        },
      ],
    },
    {
      id: 1025,
      title: '亦幻想',
      recommendations: [
        {
          name: 'W_Sonoda',
          reason: ['小细节上现真章的真机伶文。细腻。'],
        },
      ],
    },
    {
      id: 1050,
      title: '退役速子与豚鼠的故事',
      recommendations: [
        {
          name: 'TanKDJ',
          reason: [
            '在速子同人文里，描写速子因腿部受伤，无法奔跑而退役的文章有很多。其中不乏有如胶似漆的恋爱喜剧，也有撕心裂肺的痛苦悲剧。但本人要推荐的这篇速子文，大概是那种“平静似水的爱情”。',
            '剧情的走向并不复杂，算是比较普通的TL作品。吸引我的，是对速子心态的转变，以及二人平凡退役生活的细腻描写。那种一步一步被对方吸引，一步一步确认双方心意，最后一步一步地相互扶持着走下去，是最抓我的部分。比起“抱憾终生”的刀子，以及“如漆似胶”的纯糖，这篇“平淡如水”的故事更加吸引我。（当然这只是个人的口味爱好，并无抨击以上两种类型爱好者的意思）。',
            '同时译者的翻译，也让这篇文章更具有观赏与阅读性。感谢作者与译者带来的这篇文章。最后请允许我引用文中最后一段描写，来向各位推荐这篇文章。',
            '',
            '与宇宙的悠久时光相比，人的一生太过虚幻。',
            '在那一瞬间的闪光中诞生，很快大家都逐渐长大成人。',
            '能在这短暂的一闪中邂逅真正重要的人，到底需要怎样的奇迹呢?',
            '在一天结束的时候能这样确认彼此的爱，也是毫无疑问的奇迹。',
            '“晚安。',
            '……我最喜欢你了，速子。”',
            '“嗯，我也最喜欢你了。”',
            '无论是明天醒来的时候，还是再之后的早晨。',
            '——只要这条生命还跃动着，无论多少次，都会将这份思念传递下去。',
          ],
        },
      ],
    },
    {
      id: 1053,
      title: '败者的唏嘘',
      recommendations: [
        {
          name: '超合金魂DX红美铃',
          reason: [
            '本篇短篇從二創中稀少的路人馬娘角度切入，描寫了在特雷森泯然眾人的平凡馬娘的心態。像故事中面對現實被壓得喘不過氣，無力向上流動、無心向上流動的路人馬娘到底還有多少人？寥寥數十字間，我便看見了大多數的無奈。',
          ],
        },
      ],
    },

    {
      id: 1381,
      title: '无声铃鹿，毕业后的进路决定',
      others: [
        {
          id: 2062,
          title: '无声铃鹿，工作寻找中',
        },
      ],
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '以上两篇合称kuirui的毕业铃鹿系列，是kuirui老师为毕业后的铃鹿所撰写的两部短篇。看标题以为是社畜挣扎的故事，其实会吃到的是满嘴糖渣，和只会大逃的恋爱弱者铃鹿说再见吧！',
            '值得一提的是，大书库里其实设有【X年后的马娘】这一Tag，用于收录这种毕业后数年已经有别样生活气息的马娘们的故事，感兴趣的欢迎查看。',
          ],
        },
      ],
    },
    {
      id: 1443,
      title: "《Golden's Aoharu》",
      recommendations: [
        {
          name: '鬼道',
          reason: [
            '土著佬翻譯的旅程子和巨匠系列其實都很推薦，基本上出現的大多都是沒在馬娘企劃中登場或只有原設出場的偏近代未落地馬，本人便是藉此系列去了解黃金一族的各種「事蹟」，推薦對黃金船的無厘頭行徑有好感的讀者們可以多多了解這一家子，看完之後會發現阿船的離譜行徑甚至還不算是最離譜的()另外特別推薦本篇的原因主要是關於黃金巨匠一段，巨匠的凱旋門到現在仍是日本距離凱旋門最近的一次，在日本賽馬出現能稱霸凱旋門賞的馬之前絕對一直會是最大的遺憾，勝過比賽是否算是對現實的一種抒發？我認為在賽馬娘世界中對現實遺憾的補足也是此作品吸引人的重要要素之一',
          ],
        },
      ],
    },
    {
      id: 1746,
      title: '优秀素质，从毕业到同居',
      others: [
        { id: 1747, title: '优秀素质，妊娠抑郁' },
        { id: 2501, title: '优秀素质小姐，也到了这个岁数了' },
      ],
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '以上三篇合称kuirui的毕业内恰系列，是kuirui老师为毕业后的内恰所撰写的系列短篇。这种温馨的日常感最适合内恰了，不是吗？',
            '值得一提的是，大书库里其实设有【X年后的马娘】这一Tag，用于收录这种毕业后数年已经有别样生活气息的马娘们的故事，感兴趣的欢迎查看。',
          ],
        },
      ],
    },
    {
      id: 1856,
      title: '下个地球再见！(退役时刻)',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '船文中少有的“含有人性”的船，却遇到了连她都追不上的训练员。算是我目前读过的最棒的一则阿船短篇了。',
          ],
        },
      ],
    },
    {
      id: 1876,
      title: '特别周，补习时间',
      recommendations: [
        {
          name: '盈盈星尘',
          reason: [
            '一篇轻松日常的同人文，作者（译者）文笔细腻，简单几句就能很好的刻画人物性格。本篇也是似重非重，很好的写出了小特她那青春朦胧的爱情感，让人有会心一笑的感觉',
          ],
        },
      ],
    },
    {
      id: 2212,
      title: '曼城茶座-大进综合征',
      recommendations: [
        {
          name: '风之低吟',
          reason: [
            '曾经只存在于臆想中的孩子终于降临到父母身边，',
            '虽然有些伤感，但最后很幸福的一篇大进综合征。',
          ],
        },
      ],
    },
    {
      id: 3474,
      title: '那胶囊的名字是绝望药',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是一篇速子同人文，乍一看依旧是速子制药这种已经被大家写过千百遍的点子，但仔细读来才感叹文章百转千回之下的巧思：如果没有最后的结尾，全篇将落于窠臼；而有了最后的结尾之后……大家就请自己品鉴吧。',
          ],
        },
      ],
    },
    {
      id: 2426,
      title: '監 · 禁 · Fine · Motion',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '又是一篇仮名太太（匿名版桑）的力作，本文依旧是Ta最擅长的，以摄人心魄的情景布局、绵密的细节描摹和窒息般的控诉来将读者一步步推向颅内高潮的范式。',
            '是啊，这明明只该是个稍微有点努力的孩子的故事而已……',
          ],
        },
      ],
    },
    {
      id: 2519,
      title: '博导兼赛马娘爱丽速子，和她的研究生兼训练员豚鼠',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '以研究生生活为核心的玩梗向文章，适合读研的选手读来图一乐。',
            '（如果您的研究生生涯不那么令人愉快，请酌情阅读）',
          ],
        },
      ],
    },
    {
      id: 2525,
      title: '倒错的曼城茶座',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '两股相反却同样邪恶的欲望，倒错的上下关系，造就了一个疯狂而可爱的世界。比起落地后的社恐灵异女孩，还是这种带点癫狂和隐秘欲念的调性更适合茶座的人设啊……',
          ],
        },
      ],
    },
    {
      id: 2646,
      title: '冥王的伊卡洛斯',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是皇千赏企划文章，且作为一篇Parody系同人，在翻译楼乃至整个NGA赛马娘同人版而言都是少见也或许没有多少受众的，至少我不是这类作品的受众——它太抽象化了，除开人物的“性格特征”被完美保留之外，几乎抽离了其他所有原作中该有的内容。但它作为一个独立短篇而言又足够优秀（写Parody系同人的写手又有多少能完美把握角色性的内核呢），因此它无疑也是一块强而有力的砖。',
            '',
            '【本段可能包含剧透】',
            '我非常喜欢本文中对于鲁铎的那种十分克制的描写：作为一个并不像千明那样“懂得表达情绪”的AI，在鲁铎心中“应当”激荡起来的万千情绪却找不到任何一个发泄口，于是就这样在无尽的反射和内耗中消弭在了机体内部，我们永远无从知晓究竟有多么磅礴的情感暗含在无机质的文字之下。于是当我看完结尾无比震撼再回过头去看到文前强调的那一句时，我至少自认为把握住了作者最想展现出来的东西。',
          ],
        },
      ],
    },
    {
      id: 2783,
      title: '没有星星的夜空',
      recommendations: [
        {
          name: 'banerjee',
          reason: [
            '（录入者的PS：推荐来自三创；是的，推荐者为本作写了三创）',
            '把这张西服的织姬套入正文里，就一转目白城画风了，一切不言者、尽在括号中',
            '桀桀桀桀桀，黑习习，和你努力营造的沉重感说再见吧(吔！！！)',
          ],
        },
      ],
    },
    {
      id: 2797,
      title: '永远的樱花',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是NGA年末征文的参赛作品，也是我个人比较喜欢的一篇，整体是一个细腻而积极的故事，相比征文版本去掉一句画蛇添足的结尾，如今读来就显得很爽口了。',
          ],
        },
      ],
    },
    {
      id: 2829,
      title: '于下世纪末再会',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是NGA年末征文的参赛作品，获得了人气投票第五名、评委赛道入围奖。这篇选取了好歌剧实马落幕梗，在逻辑和气氛上都写得非常好，可谓是毫无保留地展现出了歌剧王的豪迈和坚强；同时又辅以训练员主视角细腻的心理，既是侧写、又是对比。当一篇文章的气氛营造到位的时候，微小的不合理是完全可以被忽略的，于是在文末，歌剧王的谢幕奔跑就显得如此浪漫又悲怆。',
          ],
        },
      ],
    },
    {
      id: 3048,
      title: '春乌拉拉的循环',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文可谓是古早时期著名的《乌拉拉有马第一》的某种意义上的精神续作。在摒弃了匿名版创作稍显随意的文字、个人而言有些出戏的游戏技能枚举以及早期翻译楼机翻润色等缺点后，由kuirui老师所著、ChibaNils海皇所翻译的本文保持了最原初的感动和最优质的风味。时间循环（TimeLoop）是一个永不冷门的点子，而围绕着它能做的文章实在太多，本文只选取了其中最关键的部分——那便是无限循环之下不变的感情与意志。',
          ],
        },
      ],
    },
    {
      id: 3063,
      title: '喜欢上朋友的训练员的爱慕织姬',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '这是我翻译过的织姬文中，比较接近我心中织姬范式的一篇失恋文学。外冷内热的织姬，沉重却重得清爽，尽管是失恋文学，读完后心中却没有阴霾，反倒是有一种毫不拖泥带水的飒爽感。',
          ],
        },
      ],
    },
    {
      id: 3078,
      title: '初恋，再见',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '一篇以小茧为主视角的失恋文学，在雨滴中与自己不可能实现的感情道别吧，「想要一个人痛快地哭一场，直到迎来明天」……很有日剧风格的一个小短篇。',
          ],
        },
      ],
    },
    {
      id: 3456,
      title: '樱花再次盛开的时候',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是某个征文比赛的参赛作品（并且斩获冠军）。是一篇相对来说比较淡口的千代王小糖水，但是整体气氛营造得非常不错，四平八稳、笔调细腻、角色性好、完成度高，很适合读来调剂心情。',
          ],
        },
      ],
    },
    {
      id: 3092,
      title: '雀的咬伤',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '尽管我不懂日麻，但本文实际上是以麻将对决为形，庆典和T之间倒错的主导权对决为实，哪怕不明白日麻专有名词，读下来也十分好味。',
          ],
        },
      ],
    },
    {
      id: 3095,
      title: '诱惑的大和赤骥',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是仮名太太（匿名版桑）的力作，是一篇非常优质的R15文学，在塑造诱惑情景、撩拨读者情欲方面实属无可匹敌。本文主要分为两个部分，前半部分为大红主视角下对T的“诱惑”，后半部分为T忍不住“诱惑”后采取的行动——实际上前半段的风味更佳，甚至令我怀疑仮名太太是否其实是一位女性作者。',
          ],
        },
      ],
    },
    {
      id: 3122,
      title: '生与死的被动吸烟',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是一篇视角独特的速子刀文，以一种“单方面倾诉”的口吻展现了一则别样风味的故事。披着科学家外皮的纯情少女，被带有烟味的情感所捕获、所抛弃，而永世无法逃离这名为烟草实为追忆的泥潭。这种奇异风格的速子实在是令人印象深刻。',
          ],
        },
      ],
    },
    {
      id: 3316,
      title: '我的担当马娘听不见声音',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '【本段可能包含剧透】',
            '和最初的预期完全不一样，“听不见声音”不只是个噱头，而多少在道德绑架之下才去接手女主角阿心的男主角训练员也并非什么救美英雄，这甚至不是一篇T-Love文章。有的只是几位鲜活的角色，他们的性格鲜明到彼此之间无法相容，却都是各自抗争命运之路上的贵人。',
            '文章在字里行间透露出作者kuirui老师相当深厚的积淀和完备的思考——从比赛生涯，到人际关系，再到社会关注，一位无闻无声的马娘究竟会遇到怎样的问题，作者都描摹出了他设想中的情况，也因而在这朴素平直的文字之下蕴含着能够深深触动读者的力量。',
            '不得不说，“原创马娘”经常被认为是一个debuff题材，而“有身体缺陷的主角”又是一重剑走偏锋的设计。而kuirui老师则完全驾驭住了它们，带来了一篇或许并不尽善尽美，但却弥足精彩的文章。尽管文中的都合成分的确不少，但在这个体量下已经处理得足够得当了。',
          ],
        },
      ],
    },
    {
      id: 3380,
      title: '午夜的狩猎',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文是一篇【原设茶座】的同人文。茶座的原设是女演员、潜在犯罪者、认主的寻血猎犬，而本文的特色就是用绵密的“单方面倾诉”来展现这一角色令人欲罢不能的特质……以及一些更加血腥的冲动。另外，同样推荐阅读由Nils海皇翻译、おはな太太所著的原设茶座长篇《Take me to paradise.》。',
          ],
        },
      ],
    },
    {
      id: 3418,
      title: '成田路想让你在意',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '本文应该是翻译楼第一篇成田路单人文。眼看着利他主义、道德模范的【好孩子】压抑自己“非道德”的感情许久后，理性之线终于溃决，【好孩子】因而变得“利己”乃至重起来，变成了【坏孩子】——但这也没什么不好，不是吗？这种暗含在感情波涛之下的心理渐变过程实在是值得玩味。不过，本文的原标题实在太烂了，好奇的可以点进去看看。',
          ],
        },
      ],
    },
    {
      id: 1607,
      title: 'DV阿尔丹',
      r: true,
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '【争议内容注意！】',
            '本文是知名战犯篇目，单刀直入地说就是，本文涉及到家庭暴力（DV）内容，会引起部分读者的不适，请在【年满18周岁】的前提下谨慎观看。',
            '但为什么依旧要推荐这篇呢，因为它的确写得非常细腻。你以为是施虐狂男方对女方的家暴吗，其实是受虐狂女方对男方的摆布哦……有悖伦常的感情，病态的依存，以被虐欲为原点的无限堕落，不洁而无辜的两人。（总感觉这篇文章扒开这病态的外壳之后，内核实质上是目白城吧？）',
            '额外Tag：家暴（DV） Ryona 重马场 倒错',
          ],
        },
      ],
    },
  ],
  creators: [
    {
      name: 'kuirui（悔類）',
      type: 0,
      recommendations: [
        {
          name: 'Nils',
          reason: [
            'Pixiv著名高产出作者。角色覆盖量大，文章词句平直但是往往能靠优秀的故事和细腻的情感取胜。',
            '在文章体量上，既有管饱的长篇or主题系列文，也有单篇故事。',
            '在角色分布上，短篇的分布比例相对均衡（长篇没办法），也包括不少作者本人思考后创作的原创角色短篇。',
            '',
            '作品当前翻译收录比例很高，产出频率也比较稳定。',
          ],
        },
      ],
    },
    {
      name: 'おはな',
      type: 0,
      recommendations: [
        {
          name: 'Nils',
          reason: [
            '个人比较中意的一位女性作者。',
            '长于氛围和心理描写，相比于一般以角色间互动作为主体的创作，她的文章中常有不小比例的“独行”和“独思”部分。',
            '相比于上面提到的kuirui桑，おはな太太的问题是“故事性”会相对薄弱一点，但是往往可以通过氛围的铺垫达成一种成功的推进效果',
            '对于那种【愁肠百转，却又只得露出一个淡淡笑容】的高湿度剧情爱好者推荐。',
            '',
            '翻译收录比例暂时不是很高，还有许多单篇和一个十分大的连载可以等待翻译，属于富矿。',
          ],
        },
      ],
    },
    {
      name: '仮名@ウマ娘怪文書',
      type: 0,
      recommendations: [
        {
          name: 'Nils',
          reason: [
            '有时候我们简称他为“匿名版桑”。正如他的名字所代表的，他的许多作品往往和“良马场”一毛钱也不沾边（某些良马场tag属于烟幕弹）。是属于在CY二创规划下来之后还玩命重+发癫（褒义）的一位作者。',
            '他的文章特点是将第一视角的狂热心理状态描写的十分到位，通过大量的换行和独白营造出一种近乎于诗歌但又耽溺于非伦理思考的状态。作品中往往也分为“猎手”和“猎物”的不同视角。交织起来阅读的体验非常的棒。',
            '',
            '不过也适当说明一下问题存在：他的作品就像是粘稠的黑糖一样，适当品味一篇味道会很棒，但是短时间大量阅读就会有一定的审美疲劳（我们翻译也经常隔一段时间再翻）。建议不要一口气读完。',
            '',
            '作品翻译收录比例相对不是太高，富矿作者。',
          ],
        },
      ],
    },
    {
      name: '华生宇',
      type: 0,
      recommendations: [
        {
          name: '风之低吟',
          reason: [
            '创作译作均丰的两栖创作者，大书库的口口剑之主',
            '其独创的口口剑文学是集中楼早期版友原创的标杆，神秘且发臭的链接地址甚至比ID都要醒目',
            '个人认为壁尻和牛郎道完全可以作为其代表，不过最喜欢的还是毫无homo要素的homo训练员这篇',
            '顺便一提，关于古龙顶之后的事情还是不要打搅他了',
          ],
        },
      ],
    },
    {
      name: '南极洲老土著',
      type: 1,
      recommendations: [
        {
          name: 'Nils',
          reason: [
            '对于“企划内未实装马”（包括老黄金这种拿不到版权的、一路通这种著名梗马、现在竞马时代的乐透心、苏妲己之类原创拟人化）进行了大量创作翻译的译者（甚至达到了单人开辟一个领域的程度）',
            '对于实马方向有兴趣的读者们推荐搜索阅读',
          ],
        },
      ],
    },
    {
      name: 'Nils',
      type: 1,
      recommendations: [{ name: '风之低吟', reason: ['老牌译者，品质保证'] }],
    },
    {
      name: 'Takatoshi',
      type: 1,
      recommendations: [
        {
          name: '风之低吟',
          reason: [
            '陪睡道起家的实力译者',
            '腾讯文档外链、折叠和折叠标题吐槽是其特色',
            '一己之力推动了目白城系列的翻译进程',
            '其用心程度，年糕看了一定会不计代价绑也要请到目白城的罢',
          ],
        },
      ],
    },
    {
      name: '鬼道',
      type: 1,
      recommendations: [
        {
          name: '风之低吟',
          reason: [
            '浑身都是肝的实力译者',
            '虽然起步较晚，但大书库收录篇目数已经挺进五强',
            '他对TS训练员、内恰奖杯、鸭葱、大进综合征、丰满马娘居酒屋、爆进之神等系列作品的贡献有目共睹',
            '自身梦想就是TS成马娘训练员被担当点心这一点在译作的铺垫后也丝毫不令人惊讶呢',
          ],
        },
      ],
    },
    {
      name: '万碎碎碎碎碎',
      type: 0,
      r: true,
      recommendations: [{ name: '风之低吟', reason: ['著名老师', '不言而喻'] }],
    },
    {
      name: '南村群童',
      type: 1,
      r: true,
      recommendations: [{ name: '风之低吟', reason: ['著名老师', '不言而喻'] }],
    },
  ],
  novels: [
    {
      id: 226,
      title: 'Take me to paradise.',
      isNovel: true,
      recommendations: [
        {
          name: '鬼道',
          reason: [
            '以茶座的個人曲為主題寫的一篇優質作品，將原設茶座的個性把握的很好，作品中提到的馬娘的宿命也是傑出的發想點，現實原型遭遇的種種藉由夢境表達並且一一實現在現實中，勝利的種種榮光以及最後的折翼，不斷掙扎擊破命運的結果卻是落得與夢中相同甚至更加慘烈之後果，最後借速子之手打碎命運給予希望，如果用樂曲來表達的話給人命運交響曲的震撼感，是不可多得的佳作',
          ],
        },
        {
          name: '黑羽仙洛',
          reason: [
            '这是一篇【原设茶座】的长篇故事。一位女演员、潜在犯罪者、认主的寻血猎犬，在结识了自己认定的“主人”——男主角训练员后，让他陪伴自己前往“乐园”的故事。おはな太太的文章胜在高湿度高感染力的心理描写与绵密的细节描写，但相对地并不长于故事性。因此，这部长篇阅读起来，可能比起故事要更看重“文字体验”上的享受。我个人最喜欢的部分，是其中有一段长达2000字的黑巧味湿吻描写，实在是至福。',
          ],
        },
      ],
    },
    {
      id: 231,
      title: '倒错的草上飞',
      isNovel: true,
      recommendations: [
        {
          name: 'W_Sonoda',
          reason: [
            'Kuirui老师细腻的笔触以及独特的描绘角度，让人心里痒痒的。打个比方就是“我感觉她什么都说了又什么都没说”。Nils老师倾力翻译，准确地传达了原文意旨。',
          ],
        },
        {
          name: '黑羽仙洛',
          reason: [
            '由kuirui老师所著、ChibaNils海皇精心翻译而成的“端着文学”代表作，以十几篇单元剧将秘而不宣的师生恋感展现得淋漓尽致。当情感潜伏在循规蹈矩的表象之下，只能通过一些看似不逾矩的小小交互一丝一丝地满溢而出时，口感将如同双向暗恋一般绵实而甜蜜，至福。',
          ],
        },
      ],
    },
    {
      id: 252,
      title: '福来诗歌剧长篇',
      isNovel: true,
      recommendations: [
        {
          name: '鬼道',
          reason: [
            '作為推薦者入坑馬娘怪文書的起源，這篇長篇與其他馬娘怪文書的不同在於其劇情，認真以劇情概述來評斷此長篇的劇情會發現，其實簡述下來真的沒什麼特別的，失憶、車禍、誤會，不外乎就是這些連韓劇都已經用爛的橋段，然而透過作者本人的文筆及安排卻能使這些本應是老到沒人想看的老梗重新發出光芒，正應了「勇者不挑選戰場」，只要文筆夠好，哪怕是老梗也能寫出花來，雖然老套但就是好用，推薦者本人淚點比較低，因此真的是邊哭邊看完的，推薦想看扭成一團的可以看看此文，個人認為屬於怪文書裡的王道類型',
          ],
        },
        {
          name: '黑羽仙洛',
          reason: [
            '论发病文学，或许没人比得上日本人那种近乎种族天赋的神经病感。本文就是一则典例。尽管本文多采用机翻润色，但这种机翻带来的无机质感却能恰与文章本身的氛围相合，产生了巧妙的、令人毛骨悚然的化学反应。尽情享受这趟地狱列车吧！',
            '【本段可能包含剧透】事实上我认为前二十二章比后半部分要优秀得多。前半部分那种如同人偶戏般的“非人”感实在是绝妙无比，以至于后半段为了收束到一个不错的结局而走上了韩剧式展开，在理解和接受的同时又十分遗憾。',
          ],
        },
      ],
    },
    {
      id: 273,
      title: '里见光钻想被〇〇',
      isNovel: true,
      recommendations: [
        {
          name: 'W_Sonoda',
          reason: [
            '看起来是瑟瑟的文，其实不是！有点类似于倒错的草上飞的风格，推荐！同样也是Nils老师翻译！',
          ],
        },
        {
          name: '黑羽仙洛',
          reason: [
            '又是一部由kuirui老师所著的单元剧集，本次的主角是光钻——这里的光钻是个稍微有些受虐癖，但又没那么过界的孩子。而本合集内的文章，也都是这么一个孩子和T之间做的一些稍稍逾矩又没那么过界的事情……嗯，很适合妄想系哦。',
          ],
        },
      ],
    },
    {
      id: 228,
      title: '东方季枫 短篇故事集',
      isNovel: false,
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '在我看来，季枫是一位很剑走偏锋的优秀短篇写手。他真的十分擅长将感情和信息量灌注在有限量文字的间隙之中，读完后回味无穷（大多怅然若失）。我曾被他调笑式地要求修改其草稿，可那草稿本身已经密实到根本无从下手了，而且以我的水平更不可能完成风格上的自洽。就是这样一位个人风格强烈的作者，请大家好好品鉴他的作品吧。本短篇集内作品现均为T-Love……（但或许大多都没Love起来）',
          ],
        },
      ],
    },
    {
      id: 230,
      title: '乌拉拉有马第一',
      isNovel: true,
      recommendations: [
        {
          name: '我就是雷gay的化身',
          reason: [
            '这篇作品在翻译楼早期建立时便已出现，需要说明的是',
            '在翻译楼早期，大家所熟知的翻译大佬（如nils，byslm，赤炎）等都尚未出现，因而早期大家用的都是翻译软件进行机翻，这篇《乌拉拉有马第一》也没有例外',
            '但在早期那种群魔乱舞（笑）的翻译环境里，这篇的出现如同代表着正常向同人翻译的一个苗头，给当时还享受着“帝下室”“uma分尸”等情节的翻译楼读者带来了不一样的体验',
            '虽然全文都是使用翻译软件进行的翻译，但其中的情节还是能让大家看懂并了解的',
            '其中的一些情节到现在也会让我不由得赞叹',
            '训练员带着乌拉拉向各位赛马娘学习技能的场面，也颇有少年漫常有的“大家的力量合为一体！”既视感（虽然也可能跑偏到z高达上就是了）',
            '总而言之，如果正在使用大书库的你并不介意观看机翻文的话，我在这里竭力向你推荐《乌拉拉有马第一》',
          ],
        },
      ],
    },
    {
      id: 235,
      title: '卡莲攻防战',
      isNovel: true,
      recommendations: [
        {
          name: '亚岚',
          reason: [
            '以卡莲酱和与训练员双视角同步展开的恋爱喜剧，颇有“鸭葱”系列那样在弄巧成拙中拉近二人关系的味道。情感细腻独特，糖分充足，是真机伶同人作品中十分值得一看的篇目。',
          ],
        },
      ],
    },
    {
      id: 237,
      title: '周日宁静和对她一见钟情的训练员先生',
      isNovel: true,
      recommendations: [
        {
          name: '南极洲老土著',
          reason: [
            '借sine佬的一句话“不知道有多少人还记得这篇ss的故事最开始只是茶座在问训练员有没有过女朋友”。一开始连译者都没想到茶座的女性交往系列能延伸出如此之长的文字。虽然漫长但夹杂着欢笑和悲伤最终走向结局，或许这个结局早就在一开始就埋下了伏笔，不要以为这就是悲剧，二人携手迎来只属于二人的最后一刻，或许这就是最美好的结局。',
          ],
        },
      ],
    },
    {
      id: 259,
      title: '致苍青色的我',
      isNovel: true,
      recommendations: [
        {
          name: 'byslm',
          reason: [
            '说实话译者本人来推荐的话有点自卖自夸的嫌疑。',
            '飞鹰本身也不是什么人气角色。',
            '全篇以醒目飞鹰作为主角，作者自设了训练员与原创马娘狂野燃烧作为指导与宿敌',
            '醒目飞鹰由一开始单纯想成为顶级马娘偶像到中途感到迷茫再到最后继承了训练员的意志决定继续闪耀下去。啊，具体还是请各位看客到本篇一览。本人语言能力有限，无法准确描绘出中途晦涩难懂的部分，而且剧透太多也很影响观感。',
            '衷心希望各位读者看完之后能喜欢上闪闪发光的马娘偶像—醒目飞鹰。',
            '那么我做的努力也算是值得的了。',
            '谢谢各位能耐心看完。再次感谢。',
          ],
        },
      ],
    },
    {
      id: 264,
      title: '被拖入其中的训练员',
      isNovel: true,
      recommendations: [
        {
          name: '风之低吟',
          reason: [
            '《被拖入其中的训练员·第一部》，让我听见了最想让深陷重马场的训练员们喊出的话。',
          ],
        },
      ],
    },
    {
      id: 277,
      title: '黄金旅程养成故事片段集',
      isNovel: false,
      recommendations: [
        {
          name: '南极洲老土著',
          reason: [
            '是的，这是译者自己的推荐。黄金旅程本马以其波澜万丈马生和令人苦笑的性格为世人所爱，那么当其化名为“金色旅程”出现在动画之中的惊喜对于那些熟悉那个时代的观众们毋庸置疑。于是这一个系列就应运而生，当傲娇的旅程在嬉笑怒骂之间和阿训不断升温她们之间的感情、率领“小弟们”黄金组在特雷森的校规下自由奔放地生活着、以及和成田路的孽缘。何尝不是一种在繁重生活下需求解压、轻松一笑的上选。',
          ],
        },
      ],
    },
    {
      id: 257,
      title: '胜利奖券VS骏川缰绳',
      isNovel: true,
      r: true,
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '【R18注意！】',
            '本系列集合了极致的官能享受与超出想象的惊悚体验，能让你在兴奋和畏惧之中反复摇摆，是很难再有的绝妙旅程。如您【已满18岁】，不妨来试试这口包裹着奶味和汗味的神秘豆吧。',
            '本推荐不对阅读该系列后产生的任何不良反应（包括但不限于女性恐惧、反胃、性冷淡、无法压抑的性欲等）负责，请您做好足够的心理准备。',
            '额外Tag：超乳 母乳 重马场 3P 预后不良',
          ],
        },
      ],
    },
    {
      id: 311,
      title: '爆进之神',
      isNovel: false,
      recommendations: [
        {
          name: '鬼道',
          reason: [
            '自作聰明的訓練員&甘願上當的進王',
            '兩人構築而成的戀愛物語，最深的愛情不是山盟海誓，而是他願意為妳扮演小丑，而妳願意為他拍手叫好，可能十分笨拙，可能使人焦急，但這就是最適合兩人的溫度，不需要急躁的氣氛，不需要挫折的磨礪，願爆進之神永遠護佑兩人',
          ],
        },
        {
          name: 'Takatoshi',
          reason: ['不善言辞的人真心为了他人而努力付出的样子总是让人心中一暖'],
        },
        {
          name: '我就是雷gay的化身',
          reason: [
            '在集合楼中，却是清流的一般青春恋爱类',
            '感慨',
            '虽然脑子可能有点问题（字面意义上）但一心为担当着想的进王T',
            '看破了一切却只是看着没有点破，包容着训练员的委员长',
            '还有我最喜欢的，在训练员和进王陷入危机时刻便会出现解决问题的爆进之神（确信）',
            '这三人（？）与特雷森学园的同学们共同创造出的故事',
            '只能说',
            '很美啊',
            '（虽然我最期待的还是周围大伙看见爆进之神出场时的反应',
            '',
            '“你这家伙，是什么人？！”',
            '“爆进的使者，爆进之神！”',
            '这样的经典名台词，也历历在目呢',
            '不过也是青春恋爱的通病吧可能',
            '好想急死你',
            '我现在急于看到训练员被进王拉去结婚',
          ],
        },
      ],
    },
    {
      id: 229,
      title: '两人三足，目标是星光闪耀的舞台！',
      isNovel: true,
      recommendations: [
        {
          name: '风之低吟',
          reason: ['甜甜甜甜甜甜甜'],
        },
      ],
    },
  ],
  series: [
    {
      id: 196,
      title: '学生会会议',
      recommendations: [
        {
          name: '女人的名字',
          reason: [
            '早期的一个很有趣的系列，虽然现在来看会有很多ooc，但是看怪文书就是要开心嘛',
          ],
        },
      ],
    },
    {
      id: 200,
      title: '寝系列',
      recommendations: [
        {
          name: '黑羽仙洛',
          reason: [
            '好，睡前听小编我说句话吧。',
            '你有听说过寝系列吗？',
            '传闻有的马娘喜欢在睡前和你讲讲故事，可她们口中所道出的话语，并不是每个人都有福消受。如果你有兴趣挑战一下自我，不妨试试这篇：《はい、寝之特雷森内裤大作战》',
            '更有传闻，有一位叫做无声铃鹿的马娘，她的睡前故事是最为令人闻风丧胆的东西……如果你在探索大书库的时候发现了这种内容，请躲得越远越好哦。',
            '好，我讲完了，你可以睡了。',
          ],
        },
      ],
    },
    {
      id: 204,
      title: '数码夫妻婚后日常',
      others: [
        {
          id: 205,
          title: '数码生放送',
        },
      ],
      recommendations: [
        {
          name: 'byslm',
          reason: [
            '【数码夫妻婚后日常】【数码生放送】是两个按时间顺序推进前后之间存在联系的系列，合称为【数码夫妻系列】。',
            '算是个人觉得翻的作品中最有烟火气的类型了，婚后日常系列主要是数码与丈夫结婚后遇到的各种事情，生放送系列与直播类似，有时会穿插数码意义不明的话语。',
            '如果喜欢数码的话请务必去看，由于是所翻的早期作品所以可能存在错字错词不太通顺的地方，还希望喜欢数码的读者不要向我丢石头orz。',
            '能看到这里的读者，再次感谢。衷心希望你也喜欢那个爱讲黄段子，喜欢马娘与丈夫，作为训练员尽心尽力以及在数码后面默默辅助的代理训练员丈夫。',
          ],
        },
      ],
    },
    {
      id: 10,
      title: 'TS训练员系列',
      join: [22, 29],
      recommendations: [
        {
          name: '鬼道',
          reason: [
            'TS訓練員',
            '顧名思義，就是關於性轉成馬娘的訓練員的故事，主要的看點便是在訓練員夾雜在男性和女性之間的性別認同感混淆，以及馬娘對其主動出擊時的性別倒錯感，雄性的意識困於雌性的身體之內，在本應是女性卻極為主動的擔當馬娘帶領下，一步步連心靈都變成完全的雌性，中間的掙扎及最後的沉淪便是最大的看點，主要推薦文為：【魯道夫 TS訓練員】、【愛慕織姬 TS訓練員】、【天狼星象徵 TS訓練員】等',
          ],
        },
        {
          name: '风之低吟',
          reason: [
            'TS训练员并没有单独的标签，在大书库内被视为【TS】、【马娘化】和【百合】等多个Tag的综合',
            '目前TS训练员基本都由鬼道佬贡献，如想观赏，请认准鬼道佬的译作',
            '不得不说该系列真的健全又涩气',
          ],
        },
      ],
    },
    {
      id: 211,
      title: '目白城',
      others: [
        { id: 303, title: '目白城设定' },
        {
          id: 304,
          title: '目白城电视台',
        },
      ],
      recommendations: [
        {
          name: 'Takatoshi',
          reason: [
            '欢迎您来到目白城考古博物馆',
            '目白城是兴起于马娘四年（公元2021年）的一座城市，在怪文书文化的发展进程中起到了举足轻重的作用。其与帝下室、铃鹿寝等其他题材共同确保了训练员作为马娘祭品的主要方向，拓宽了【一心同体】等词汇的解释范围，为后世留下了深远影响。',
            '综合目前的考古结果，学术界认为目白城的历史主要可分为数个阶段：',
            '',
            '——零期【目白城电视台】：',
            '首篇作品【目白城：起源】以电视台对毕业后麦昆的采访，结合其下的回复，为整个目白城打下了基础设定：向往贫困生活的麦昆除了在生活上处处做旧以外，也在其余方向上大肆投资，力求能够破产而与训练员一起过上拮据但充满爱意的日子。',
            '节目后来也采访了其余不少定居于目白城的马娘，其中让人感觉十分混沌的镜头不在少数，这也是目白城的核心元素中始终有一份疯狂感的原因之一。',
            '',
            '——一期【目白城设定】：',
            '在目白城电视台的采访节目开播后不久，【目白公寓 招租中】作为第一篇主要内容为目白城设施的文章呱呱落地。以此为契机，各类描绘目白城具体内容的怪文书爆发般地出现，最多时甚至每天可有十数篇。目白城的众多设施均对标现实世界中日本各地的大型场馆，种种地方也都在满脑一心同体的麦昆指导下掺杂了数不胜数的马跳要素。',
            '然而如此铺张的规模却并未如麦昆所愿产生赤字——大概是因为由她的欲求之中诞生的想法正是切实符合马娘们的需要，所以即便麦昆补贴补贴再补贴也仍旧没有成功亏钱。',
            '',
            '——二期【游记】：',
            '在目白城的飞速建设之下，【前往麦昆家做客的东海帝王】自然而然地出现了。与一期内容大量堆砌设定的写法不同，二期内容则主要是以访客的视角记录下自己前往目白城的所见所闻，更具有故事性。有时是以马娘的角度主动约训练员前往，有时则是毫不知情的训练员羊入虎口。文末常常出现的发票收据以及上面离谱的名目和折扣，无不昭示着这一切都在事前经过了周密的筹划。',
            '',
            '——三期【注释】：',
            '以自己想要进行一心同体的理由而建起各种设施，开展各种活动的麦昆似乎永远不会在对一心同体概念的散播上感到疲惫。目白城中的市民们或许也是受到了麦昆的感染，理解了她的想法，仿效着她最开始为自己建起破旧公寓（新建，设施齐备）的做法，为自己的生活中加起了料。明明始终都是夫妻二人的故事，但只要假装加入一些非日常的要素（注释），就能为自己带来新鲜感，维持爱情的活力。',
            '至于为什么都是在做那种事情的时候加入新鲜感……想必也不用再说了吧。',
          ],
        },
      ],
    },
    {
      id: 26,
      title: '组合屋',
      recommendations: [
        {
          name: '南极洲老土著',
          reason: [
            '在（特雷森）山的那边，海的那边，有一群气性难。',
            '她们活泼又强大，她们调皮又灵敏。',
            '她们自由自在生活，在那荒凉的组合屋',
            '她们搞事折腾相互都拆台',
            '',
            '哦，强大的气性难',
            '哦，强大的气性难',
            '她们齐心合力发扬脾气折腾了训练员。',
            '她们唱歌跳舞快乐多欢心',
            '',
            '这里是一间集合了以某位口罩超三冠马为首的气性难们聚集地般的ikze队（别名：希望队）的实质队伍活动室（附带电气栅栏）',
            '因为远离学园用地所以该队的训练员以自行车为代步工具。',
            '虽说如此，但实际上这所优秀马娘辈出的队伍也有其正式的活动室，目前因为里面被训练员个人物品什么的堆得乱七八糟，所以无法使用。',
            '就算这样的小屋时不时也会有队外的某位噗咿噗咿英雄大人，只会说着呜...真机伶好可爱的短距离霸主，世界第一的芦毛控前来造访。',
            '',
            '————实际上只会存在幻觉中————',
          ],
        },
      ],
    },
  ],
};

const editorList = [
  '黑羽仙洛',
  '风之低吟',
  'ChibaNils',
  'byslm',
  'Alanポポ',
  '提里奥·屠鸡者',
  '盈盈星尘',
  '女人的名字',
  'NagatoSnake',
];

const staffList = [
  'byslm',
  'ChibaNils',
  'ken啊我',
  'NagatoSnake',
  'nameabcd',
  'STROHEIM',
  'Takatoshi',
  'Tye_sine',
  'z2566687',
  '万碎碎碎碎碎',
  '千綿奏',
  '女人的名字',
  '风之低吟',
  '东方季枫',
  '华生宇',
  '进击的南村群童',
  '南极洲老土著',
  '陨落赤炎',
  '莫名的不知火',
  '提里奥·屠鸡者',
  '黑羽仙洛',
].filter((v, i, l) => {
  return l.indexOf(v) === i;
});

recommendations.creators.sort((a, b) => {
  const rA = !!a.r,
    rB = !!b.r;
  if (rA === rB) {
    if (a.recommendations.length === b.recommendations.length) {
      if (a.type === b.type) {
        return a.name > b.name ? 1 : -1;
      }
      return a.type - b.type;
    }
    return b.recommendations.length - a.recommendations.length;
  }
  return rA - rB;
});

recommendations.novels.sort((a, b) => {
  const rA = !!a.r,
    rB = !!b.r;
  if (rA === rB) {
    if (a.recommendations.length === b.recommendations.length) {
      if (a.isNovel === b.isNovel) {
        return a.title > b.title ? 1 : -1;
      }
      return b.isNovel - a.isNovel;
    }
    return b.recommendations.length - a.recommendations.length;
  }
  return rA - rB;
});

function getLen(l) {
  if (!l || !l.length) {
    return 0;
  }
  return l.length;
}

function tagArtComparator(a, b) {
  const rA = !!a.r,
    rB = !!b.r;
  if (rA === rB) {
    if (a.recommendations.length === b.recommendations.length) {
      const lenA = getLen(a.others),
        lenB = getLen(b.others);
      if (lenA === lenB) {
        return a.id - b.id;
      }
      return lenB - lenA;
    }
    return b.recommendations.length - a.recommendations.length;
  }
  return rA - rB;
}

recommendations.articles.sort(tagArtComparator);
recommendations.series.sort(tagArtComparator);

const alias = {};
alias['东海帝王'] = ['东海帝皇'];
alias['东瀛佐敦'] = ['岛川乔登'];
alias['名将怒涛'] = ['名将户仁'];
alias['名竞应援'] = ['齐叫好'];
alias['圣王光环'] = ['帝王光辉', '帝皇光辉'];
alias['大拓太阳神'] = ['大德太阳'];
alias['安身立命'] = ['幸存者'];
alias['待兼诗歌剧'] = ['待兼唐怀瑟'];
alias['成田白仁'] = ['成田拜仁'];
alias['成田路'] = ['成田速王'];
alias['摩耶重炮'] = ['重炮'];
alias['春乌拉拉'] = ['春乌菈菈'];
alias['曼城茶座'] = ['曼哈顿咖啡'];
alias['樱花进王'] = ['樱花蓦进王'];
alias['目白赖恩'] = ['目白莱恩', '目白雷恩'];
alias['第一红宝石'] = ['第一红宝'];
alias['艾尼斯风神'] = ['艾尼风神'];
alias['菱亚马逊'] = ['亚马逊'];
alias['超级小海湾'] = ['超级小溪', '超级溪流'];
alias['鲁铎象征'] = ['鲁道夫象征'];

module.exports = {
  alias,
  editors: editorList,
  elTagTypes: ['info', '', 'warning', 'success', 'danger'],
  recommendations,
  signInfo: {
    content: '内容：NGA赛马娘翻译交流群 | 开发：风之低吟（NGA） | 版本：2.1.0',
    pubKey:
      '04f7c5d1bf43e06c4a119deb999c33a488fc38d1a7f6387cdc0001ed190d6b304846b3d2931fb15f819c6e57ac7ce119f8c68e376a5631d5ccfc1f712a51187123',
    sign:
      '3044022035ca6cab61e8244b0900c2f813a776a11d6131d1a15b20aaeb8b23ee67c19fba02201f90444525a5bcfb375e7b35180c9c1f8e66e868f5dbdca68ed7554682f3bf19',
  },
  staffs: staffList,
  tagTypes: ['其他', '角色', '系列', '长篇/合集', '争议/不适'],
};
